// напиши цикл, который повторится 10 раз. Каждый раз выводи в консоль текст "ненавижу парное программирование". 
let string = " Ненавижу парное программирование";

   for(i = 0; i <= 10; i++ ){
     console.log(i + string)
   }

// В том же файле ниже напиши цикл, который повторится миллион раз. В консоль ничего выводить не нужно. 
for(i = 0; i <= 1000000; i++){
    console.log()
}

// Ниже напиши цикл, который выведет в консоль числа от 0 до 100. 
for(i = 0; i <= 100; i++ ){
    console.log(i)
  }

  // Ниже напиши цикл, который выведет в консоль числа от 500 до 1000
  for(i = 500; i <= 1000; i++ ){
    console.log(i)
  }

  // Ниже напиши цикл, который выведет в консоль числа от 1000 до 0 (сначала постарайся самостоятельно, если не получится отправляйся в гугл). 
  