// пустой массив;
let a = []

// массив с тремя числовыми элементами;
let b = [1, 2, 3]

// массив с тремя строковыми элементами;
let c = ["a", "b", "c"]

// массив с тремя строковыми и с тремя числовыми элементами;
let q = ["a", "b", "c", 1, 2, 3]

// массив с именами всех твоих одногруппников;
let allName = ["Rasul", "Muhammad", "Abdul-Vahab", "Muhammad"]

// массив, в котором есть число, строка, null, undefined, true и false;
let z = [1, "string", null, undefined, true, false]

// массив, внутри которого три пустых массива;
let pust = [[], [], []]

// массив, внутри которого два массива, а внутри каждого вложенного массива любые три числа.
let pust2 = [[1, 2, 3], [4, 5, 6]]